modules/common/src/test/resources/com/l7tech/common/resources/wssInterop/interop_2008_layer7_222_response.xml

<s12:Envelope xmlns:s12="http://www.w3.org/2003/05/soap-envelope"><s12:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" s12:mustUnderstand="true"><wsu:Timestamp wsu:Id="Timestamp-1-44924c7b0017a655048aadb9326c68b4"><wsu:Created>2008-10-28T03:07:18.479399337Z</wsu:Created><wsu:Expires>2008-10-28T03:12:18.479Z</wsu:Expires></wsu:Timestamp><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"><ds:DigestMethod xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod></xenc:EncryptionMethod><dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">CuJdE1B2dUFd1dkLZSzQ5vj6MYg=</wsse:KeyIdentifier></wsse:SecurityTokenReference></dsig:KeyInfo><xenc:CipherData><xenc:CipherValue>XT1HQ9g+XCJQQkywGHLZM7g5F1CnuLBRDQ126TZa7KqMLRLPbyVMCunVwhKM+hZcR6nG9ZBwk2TnYOVMUCS1bP/uXO0C3UvuFFzNHFAoRgIN5By336SYaAJ4ZI4K1YWo7KQb7zLvpKXkYfOy13DqW072cAf+BF3wAErnhze2MHE=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#Body-3-f6f794ce2f4d8eb8aa3a4182bc89f8f1"></xenc:DataReference></xenc:ReferenceList></xenc:EncryptedKey><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#Body-0-b322b40c34103baccd2e5bd159c71c67"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>2KPwaNxzhHq0swy3Ed7aeh8z1XQ=</ds:DigestValue></ds:Reference><ds:Reference URI="#Timestamp-1-44924c7b0017a655048aadb9326c68b4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>eWpUgA8CE5v+o/AcF10m8qjtgXU=</ds:DigestValue></ds:Reference><ds:Reference URI="#SecurityTokenReference-2-52ae4c84e251de4f16be6e6ad92a204a"><ds:Transforms><ds:Transform Algorithm="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform"><wsse:TransformationParameters><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod></wsse:TransformationParameters></ds:Transform><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>YCmT7JDEZ+uwfMJ20B1nzbdTAYQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>eWcB/zr80ODasbcChN+GnZs1kpZ5my0naegB9uT1yyxovwDEOI9AgA4LtM7TD4UMO+t52JXTXgGuTX6Gu83ojheVhR9Yym6KVudXuoQfvV9VtZ4dWDkJD4U3p4J2sCJfe8VOm1JPdEi/CsZRjeIQbn8+vjb4VzEzDmEDC39opV8=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference wsu:Id="SecurityTokenReference-2-52ae4c84e251de4f16be6e6ad92a204a"><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></s12:Header><s12:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body-0-b322b40c34103baccd2e5bd159c71c67"><EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Id="Body-3-f6f794ce2f4d8eb8aa3a4182bc89f8f1" Type="http://www.w3.org/2001/04/xmlenc#Content"><EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"></EncryptionMethod><CipherData><CipherValue>7E7Q/VyeGtDHVoBd8F1SmyfJIkHcHTpiUB/oVGXXJXOnAP3DIvJqGxwMqb5mqRN6/GFKChjAZGATTweHBsjPSu7s6+6ACq881RUgXNjNULaDgeXYBTvp95LO3RMTyGLW1v2cPpzG/jWz1xshvxWEoN1qbYiGrLHsxH9ZpfDxhUcgknFnZGSEZD1srBBV57Uc</CipherValue></CipherData></EncryptedData></s12:Body></s12:Envelope>